Làm sạch dữ liệu cơ bản

1.Tạo dữ liệu

In [29]:
import pandas as pd

data = {
    "id": [1, 2, 3, 4, 5],
    "name": ["Anh", "Phong", "Phu", "Em", None],
    "age": [15, 14, 18, 28, 50],
    "email": ["anh@viu.edu.vn", "phong@vanlanguni.vn", "phu@yahoo.com", "em@gmail.com", None],
    "salary": [None, 70000, 10000, 25000, 15000]
}

df = pd.DataFrame(data)
print(df)

   id   name  age                email   salary
0   1    Anh   15       anh@viu.edu.vn      NaN
1   2  Phong   14  phong@vanlanguni.vn  70000.0
2   3    Phu   18        phu@yahoo.com  10000.0
3   4     Em   28         em@gmail.com  25000.0
4   5   None   50                 None  15000.0

In [30]:
#Lấy ra 5 dòng đầu tiên
df.head()

   id   name  age                email   salary
0   1    Anh   15       anh@viu.edu.vn      NaN
1   2  Phong   14  phong@vanlanguni.vn  70000.0
2   3    Phu   18        phu@yahoo.com  10000.0
3   4     Em   28         em@gmail.com  25000.0
4   5   None   50                 None  15000.0

In [31]:
#Kiem tra du lieu thieu
df.isnull().sum()

id        0
name      1
age       0
email     1
salary    1
dtype: int64

In [32]:
df["salary"].fillna(df["salary"].mean(), inplace=True)

C:\Users\phat1\AppData\Local\Temp\ipykernel_4428\2864680307.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["salary"].fillna(df["salary"].mean(), inplace=True)

In [33]:
df["name"].fillna("Unknown", inplace=True)
df["email"].fillna("Unknown", inplace=True)

C:\Users\phat1\AppData\Local\Temp\ipykernel_4428\1058652702.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["name"].fillna("Unknown", inplace=True)
C:\Users\phat1\AppData\Local\Temp\ipykernel_4428\1058652702.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["email"].fillna("Unknown", inplace=True)

In [34]:
df.isnull().sum()

id        0
name      0
age       0
email     0
salary    0
dtype: int64

In [35]:
#Luu du lieu da lam sach
df.to_csv("dulieulamsach.csv", index=False)

In [36]:
#Chuan hoa cot email bnag cach chuyen ve chu thuong 
df["email"]= df["email"].str.lower()


df

   id     name  age                email   salary
0   1      Anh   15       anh@viu.edu.vn  30000.0
1   2    Phong   14  phong@vanlanguni.vn  70000.0
2   3      Phu   18        phu@yahoo.com  10000.0
3   4       Em   28         em@gmail.com  25000.0
4   5  Unknown   50              unknown  15000.0

**Bai Tap Ve Nha**
### Cho dữ liệu dirty_data.csv
1. Kiểm tra dữ liệu bị thiếu :
   -Kiểm tra các cột có dữ liệu thiếu 
   -Điền giá trị phù hợp hoặc loại bỏ các hàng có quá nhiều dữ liệu thiếu
2. Phát hiện và sửa lỗi dữ liệu bất thường:
   -Tìm các gias trị bất thường trong cột tuổi (age) có thể là âm hoặc quá lớn 
   -Kiểm tra cột thu nhập (income) để phát hiện dữ liệu bị sai
3. Chuẩn hóa dạng dữ liệu :
   -Chuyển đổi cột ngày sinh và dạng chuẩn yyyy-mm-d
   -Chuẩn hóa dữ liệu trong cột giới tính (gender) để chỉ có 2 giới tính hợp lệ "Male" và "Female"
4. Xác định và xóa các bản ghi trùng lặp dựa trên thông tin khách hàng
   -Xuất dữ liệu sạch:
5. Lưu tập dữ liệu đã làm sạch thành tệp mới clean_data.csv

1. Kiểm tra dữ liệu bị thiếu :
   -Kiểm tra các cột có dữ liệu thiếu 
   -Điền giá trị phù hợp hoặc loại bỏ các hàng có quá nhiều dữ liệu thiếu

In [37]:
import pandas as pd

# Đọc dữ liệu từ file
dirty_data = pd.read_csv('dirty_data.csv')

# Kiểm tra các cột có dữ liệu thiếu
missing_data = dirty_data.isnull().sum()

# In ra số lượng dữ liệu bị thiếu trong các cột
print("Dữ liệu bị thiếu trong các cột:\n", missing_data)

# Đảm bảo cột "income" là kiểu số, chuyển đổi các giá trị không hợp lệ thành NaN
dirty_data['income'] = pd.to_numeric(dirty_data['income'], errors='coerce')

# Điền giá trị trung bình cho các cột numeric bị thiếu
dirty_data['age'].fillna(dirty_data['age'].mean(), inplace=True)
dirty_data['income'].fillna(dirty_data['income'].median(), inplace=True)


# Loại bỏ các hàng có quá nhiều dữ liệu thiếu (số lượng missing > 2)
dirty_data.dropna(thresh=dirty_data.shape[1]-2, inplace=True)

Dữ liệu bị thiếu trong các cột:
 customer_id    0
name           0
age            1
gender         0
dob            0
income         1
email          0
dtype: int64

C:\Users\phat1\AppData\Local\Temp\ipykernel_4428\699105966.py:16: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dirty_data['age'].fillna(dirty_data['age'].mean(), inplace=True)
C:\Users\phat1\AppData\Local\Temp\ipykernel_4428\699105966.py:17: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dirty_data['income'].fillna(dirty_data['income'].median(), inplace=True)

2. Phát hiện và sửa lỗi dữ liệu bất thường:
   -Tìm các gias trị bất thường trong cột tuổi (age) có thể là âm hoặc quá lớn 
   -Kiểm tra cột thu nhập (income) để phát hiện dữ liệu bị sai

In [38]:
# Phát hiện và sửa lỗi dữ liệu bất thường trong cột "age"
dirty_data = dirty_data[dirty_data['age'] >= 0]  # Loại bỏ các giá trị âm trong cột "age"
dirty_data = dirty_data[dirty_data['age'] <= 120]  # Loại bỏ các giá trị quá lớn trong cột "age"

# Phát hiện và sửa lỗi dữ liệu bất thường trong cột "income"
dirty_data = dirty_data[dirty_data['income'] > 0]  # Loại bỏ các giá trị âm hoặc bằng 0 trong cột "income"
dirty_data

,customer_id,name,age,gender,dob,income,email
0,101,Nguyen Van A,25.0,Male,1998-05-22,1200.0,a@example.com
1,102,Tran Thi B,42.0,Female,1981-07-14,4500.0,b@example.com
4,105,Pham Thi E,30.0,Fem,1993-09-30,3800.0,e@example.com
5,106,Nguyen Van F,38.2,M,1996-11-02,2500.0,f@example.com
6,107,Bui Thi G,29.0,Female,1994/06/15,3800.0,g@example.com
7,108,Dang Van H,40.0,f,1990-01-29,4200.0,h@example.com
8,109,Vo Thi I,27.0,Male,1995-04-10,3900.0,i@example.com
9,110,Phan Van J,22.0,unknown,1999-12-20,3800.0,j@example.com
10,110,Phan Van J,22.0,Male,1999-12-20,3900.0,j@example.com

3. Chuẩn hóa dạng dữ liệu :
   -Chuyển đổi cột ngày sinh và dạng chuẩn yyyy-mm-d
   -Chuẩn hóa dữ liệu trong cột giới tính (gender) để chỉ có 2 giới tính hợp lệ "Male" và "Female"

In [39]:
# Chuyển đổi cột "dob" (ngày sinh) về dạng chuẩn yyyy-mm-dd
dirty_data['dob'] = pd.to_datetime(dirty_data['dob'], errors='coerce')

# Chuẩn hóa dữ liệu trong cột giới tính (gender) chỉ có 2 giá trị hợp lệ: "Male" và "Female"
dirty_data['gender'] = dirty_data['gender'].apply(lambda x: 'Male' if x.lower() in ['male', 'm'] else ('Female' if x.lower() in ['female', 'f'] else 'Unknown'))

# Loại bỏ các giá trị "Unknown" trong cột giới tính
dirty_data = dirty_data[dirty_data['gender'] != 'Unknown']
dirty_data

    customer_id          name   age  gender        dob  income          email
0           101  Nguyen Van A  25.0    Male 1998-05-22  1200.0  a@example.com
1           102    Tran Thi B  42.0  Female 1981-07-14  4500.0  b@example.com
5           106  Nguyen Van F  38.2    Male 1996-11-02  2500.0  f@example.com
6           107     Bui Thi G  29.0  Female        NaT  3800.0  g@example.com
7           108    Dang Van H  40.0  Female 1990-01-29  4200.0  h@example.com
8           109      Vo Thi I  27.0    Male 1995-04-10  3900.0  i@example.com
10          110    Phan Van J  22.0    Male 1999-12-20  3900.0  j@example.com

4. Xác định và xóa các bản ghi trùng lặp dựa trên thông tin khách hàng
   -Xuất dữ liệu sạch:

In [40]:
# Xác định và xóa các bản ghi trùng lặp dựa trên thông tin khách hàng
dirty_data.drop_duplicates(subset=['customer_id'], keep='first', inplace=True)
dirty_data

C:\Users\phat1\AppData\Local\Temp\ipykernel_4428\1630722091.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dirty_data.drop_duplicates(subset=['customer_id'], keep='first', inplace=True)

    customer_id          name   age  gender        dob  income          email
0           101  Nguyen Van A  25.0    Male 1998-05-22  1200.0  a@example.com
1           102    Tran Thi B  42.0  Female 1981-07-14  4500.0  b@example.com
5           106  Nguyen Van F  38.2    Male 1996-11-02  2500.0  f@example.com
6           107     Bui Thi G  29.0  Female        NaT  3800.0  g@example.com
7           108    Dang Van H  40.0  Female 1990-01-29  4200.0  h@example.com
8           109      Vo Thi I  27.0    Male 1995-04-10  3900.0  i@example.com
10          110    Phan Van J  22.0    Male 1999-12-20  3900.0  j@example.com

5. Lưu tập dữ liệu đã làm sạch thành tệp mới clean_data.csv

In [41]:
# Lưu tập dữ liệu đã làm sạch thành tệp mới clean_data.csv
dirty_data.to_csv('clean_data.csv', index=False)
dirty_data

    customer_id          name   age  gender        dob  income          email
0           101  Nguyen Van A  25.0    Male 1998-05-22  1200.0  a@example.com
1           102    Tran Thi B  42.0  Female 1981-07-14  4500.0  b@example.com
5           106  Nguyen Van F  38.2    Male 1996-11-02  2500.0  f@example.com
6           107     Bui Thi G  29.0  Female        NaT  3800.0  g@example.com
7           108    Dang Van H  40.0  Female 1990-01-29  4200.0  h@example.com
8           109      Vo Thi I  27.0    Male 1995-04-10  3900.0  i@example.com
10          110    Phan Van J  22.0    Male 1999-12-20  3900.0  j@example.com